[{"ComputerName":"MOCK-HOST","Name":"mock-switch","Id":"dff9d5bd-a474-4c3a-a00c-1f4deb9e63a7","Notes":"","SwitchType":2,"AllowManagementOS":true,"NetAdapterInterfaceDescription":"Microsoft Network Adapter Multiplexor Driver","AvailableVMQueues":0,"NumberVmqAllocated":0,"IovEnabled":false,"IovVirtualFunctionCount":0,"IovVirtualFunctionsInUse":0,"IovQueuePairCount":0,"IovQueuePairsInUse":0,"AvailableIPSecSA":0,"NumberIPSecSAAllocated":0,"BandwidthPercentage":10,"BandwidthReservationMode":2,"DefaultFlowMinimumBandwidthAbsolute":100000000,"DefaultFlowMinimumBandwidthWeight":0,"Extensions":["Microsoft.HyperV.PowerShell.VMSwitchExtension","Microsoft.HyperV.PowerShell.VMSwitchExtension","Microsoft.HyperV.PowerShell.VMSwitchExtension"],"IovSupport":false,"IovSupportReasons":["The chipset on the system does not do interrupt remapping, without which SR-IOV cannot be supported.","To use SR-IOV on this system, the system BIOS must be updated to allow Windows to control PCI Express. Contact your system manufacturer for an update.","SR-IOV cannot be used on this system as the PCI Express hardware does not support Access Control Services (ACS) at any root port. Contact your system vendor for further information.","This system has a security vulnerability in the system I/O remapping hardware. As a precaution, the ability to use SR-IOV has been disabled. You should contact your system manufacturer for an updated BIOS which enables Root Port Alternate Error Delivery mechanism. If all Virtual Machines intended to use SR-IOV run trusted workloads, SR-IOV may be enabled by adding a registry key of type DWORD with value 1 named IOVEnableOverride under HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Virtualization and changing state of the trusted virtual machines. If the system exhibits reduced performance or instability after SR-IOV devices are assigned to Virtual Machines, consider disabling the use of SR-IOV.","This network adapter does not support SR-IOV."],"IsDeleted":false,"Key":null}]
